### [참고] <a href="https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf">Pandas Cheat Sheet</a>

https://pandas.pydata.org/docs/user_guide/missing_data.html

#### NaN(Not a Number) - 표현 불가능한 데이터(비어 있는 값)

- NaN : missing value 를 표현하는 기본 형태
- 기본적으로 float 형식으로 처리됨

#### NA(Not Available) : 결측값
#### None : 값의 부재(값이 존재하지 않거나, 없음, 정의되지 않음)

In [2]:
import pandas as pd

### [실습 1]

#### 1) missing data 가 포함된 데이터 프레임 생성

In [17]:
df = pd.DataFrame({
    "name":["Alfred","Batman","Catwoman"],
    "toy":[pd.NA,"Batmobile","Bullwhip"],
    "born":[None, pd.Timestamp("19400425"),pd.NaT]
})
df

       name        toy       born
0    Alfred       <NA>        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

#### 2) 데이터 타입 확인

In [4]:
df.dtypes

name            object
toy             object
born    datetime64[ns]
dtype: object

#### 3) missing data 처리

**dropna : missing values 제거**

In [5]:
df.dropna?

Signature:
df.dropna(
    *,
    axis: 'Axis' = 0,
    how: 'AnyAll | NoDefault' = <no_default>,
    thresh: 'int | NoDefault' = <no_default>,
    subset: 'IndexLabel' = None,
    inplace: 'bool' = False,
    ignore_index: 'bool' = False,
) -> 'DataFrame | None'
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    Pass tuple or list to drop on multiple axes.
    Only a single axis is allowed.

how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

thresh : int, optional
    Require that many non-NA values. Cannot be combined with how.
subset : column label or sequence of labels, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    Whether to modify the DataFrame rather than creating a new one.
ignore_index : bool, default ``False``
    If ``True``, the resulting axis will be labeled 0, 1, …, n - 1.

    .. versionadded:: 2.0.0

Returns
-------
DataFrame or None
    DataFrame with NA entries dropped from it or None if ``inplace=True``.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'toy'])
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
File:      d:\source\pythonsource\lib\site-packages\pandas\core\frame.py
Type:      method

df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

In [6]:
# axis=column 기준으로 하나라도(any) null값(missing data)이 존재하면 해당 column 제거

df.dropna(axis=1, how="any")

       name
0    Alfred
1    Batman
2  Catwoman

In [7]:
# default : axis=0(=index), how="any"

df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [8]:
# 둘 이상의 열에 결측값(missing data)이 존재 시 해당 행 삭제

df.dropna(how="all")

       name        toy       born
0    Alfred       <NA>        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

**fillna : missing values 를 임의의 값으로 채우기**

In [18]:
values = {"name":"noname","toy":"Bat","born":pd.Timestamp("1979-05-30")}

df.fillna(
    value=None,
    method=None,
    axis=None,
    inplace=False,
    limit=None,
    downcast=None,
)

In [19]:
# fillna(value="Null을 대체할 값")

df.fillna(pd.Timestamp("1999-01-01"))

       name                  toy       born
0    Alfred  1999-01-01 00:00:00 1999-01-01
1    Batman            Batmobile 1940-04-25
2  Catwoman             Bullwhip 1999-01-01

### [실습 2]

In [20]:
data = {
    "name":["John","Nate","Yuna","Abraham","Jenny","Brian","Nate","John"],
    "job":["teacher","teacher","teacher","student","student","student","teacher","student"],
    "age":[40,35,37,10,12,11,None,None]
}
df = pd.DataFrame(data)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Jenny  student  12.0
5    Brian  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [10]:
df.shape

(8, 3)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 324.0+ bytes

In [13]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [14]:
df.fillna(0)

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Jenny  student  12.0
5    Brian  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

<b>* 상식적으로 나이가 0인 것은 말이 안되니까 그럴듯하게 변경하기</b><br>
<b>* 선생님의 나이는 다른 선생님들 나이의 평균값으로, 학생들의 나이또한 평균값으로 변경하기</b>

In [21]:
df.groupby("job")["age"].transform("median")

0    37.0
1    37.0
2    37.0
3    11.0
4    11.0
5    11.0
6    37.0
7    11.0
Name: age, dtype: float64

In [23]:
df.age.fillna(df.groupby("job")["age"].transform("median"),inplace=True)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Jenny  student  12.0
5    Brian  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [24]:
import numpy as np

### 실습

In [25]:
# 결측값 : None / pd.Nat / pd.Na / np.nan

df = pd.DataFrame(
    [
        [np.nan, 2, np.nan,0],
        [3,4,np.nan,1],
        [np.nan,np.nan,np.nan,5]
    ],
    columns=list('ABCD')
)

df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [26]:
df.isna()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [27]:
# 모든 결측값을 0으로 채우기

df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [30]:
# 특정 값으로 채우기
# A : 0, B: 1, C: 2, D: 3

df.fillna({"A":0, "B":1,"C":2,"D":3})

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [37]:
# D칼럼의 중앙값으로 결측값 채우기

# df["D"].median()

df.fillna(df["D"].median())

     A    B    C  D
0  1.0  2.0  1.0  0
1  3.0  4.0  1.0  1
2  1.0  1.0  1.0  5

### NaN
- NaN : np.nan, pd.Nat, pd.Na, None
    - None : 비교 가능
    - np.nan : 비교 불가능

In [38]:
np.nan != np.nan

True

In [39]:
np.nan == np.nan

False

In [40]:
pd.NaT == pd.NaT

False

In [41]:
pd.NA == pd.NA

In [42]:
None == None

True